src/Documents/ДолговыеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДолговыеОперации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПоДолгам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДолговыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиПоДолгам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПоДолгам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыДолговыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДолговыхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выдача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/НаправлениеДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НаправлениеДолга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МыДолжны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НамДолжны</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДолга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПогашен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Долги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДолга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеДолга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДолга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ДолговыеОперации/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	
	Движение.Период = Дата;
	
	Движение.Кошелек = Кошелек;
	Движение.Сумма = Сумма;
	
	ЭтоПриходДенег = ОпределитьНаправлениеДвижениеДенег();
	
	Если ЭтоПриходДенег Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
	КонецЕсли;		
	
	Движения.ОстаткиПоДолгам.Записывать = Истина;
	Движение = Движения.ОстаткиПоДолгам.Добавить();
	
	Движение.Период = Дата;
	
	Движение.Долг = Долг;
	Движение.Сумма = Сумма;

	Если ВидОперации = Перечисления.ВидыДолговыхОпераций.Выдача Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
	Иначе 
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	
	Движения.Записать();
	
	ОбновлениеСтатусаДолга(Долг);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ОпределитьНаправлениеДвижениеДенег()
	
	Если ВидОперации = Перечисления.ВидыДолговыхОпераций.Выдача Тогда
		
		Если Долг.НаправлениеДолга = Перечисления.НаправлениеДолга.МыДолжны Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
	Иначе
		
		Если Долг.НаправлениеДолга = Перечисления.НаправлениеДолга.НамДолжны Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Процедура ОбновлениеСтатусаДолга(СсылкаНаДолг)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиПоДолгамОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	Долги.Ссылка КАК Ссылка,
	|	Долги.СуммаДолга КАК СуммаДолга,
	|	Долги.Статус КАК Статус
	|ИЗ
	|	Справочник.Долги КАК Долги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоДолгам.Остатки(, ) КАК ОстаткиПоДолгамОстатки
	|		ПО (ОстаткиПоДолгамОстатки.Долг = Долги.Ссылка)
	|ГДЕ
	|	Долги.Ссылка = &СсылкаНаДолг";
	Запрос.УстановитьПараметр("СсылкаНаДолг", СсылкаНаДолг); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйСтатус = Неопределено;
		
		Если Выборка.СуммаОстаток >= Выборка.СуммаДолга Тогда
			
			НовыйСтатус = Перечисления.СтатусыДолга.Активен;
			
		ИначеЕсли Выборка.СуммаОстаток <= 0 Тогда
			
			НовыйСтатус = Перечисления.СтатусыДолга.Погашен;   
			
		Иначе 
			
			НовыйСтатус = Перечисления.СтатусыДолга.ЧастичноПогашен; 
			
		КонецЕсли;
		
		Если НовыйСтатус <> Неопределено И Выборка.Статус <> НовыйСтатус Тогда
			
			ОбъектДолга = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектДолга.Статус = НовыйСтатус;
			ОбъектДолга.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 


#КонецОбласти
